In [6]:
# importing pandas

dataFrame = pn.DataFrame([[2,4,6],[10,20,30]], columns=["col1", "col2", "col3"], index=["row1","row2"])
print(dataFrame)

      col1  col2  col3
row1     2     4     6
row2    10    20    30

In [12]:
# Selecting column 1
print(dataFrame.col1)

# Calculating mean
print(dataFrame.col1.mean())

row1     2
row2    10
Name: col1, dtype: int64
6.0

In [1]:
# importing pandas
import pandas as pn

# Using Dictionaries as dataframes
datos = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}
df2 = pn.DataFrame.from_dict(datos)
print(df2)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [11]:
# Printing shape parameters
size = df2.shape
rows = size[0]
cols = size[1]

print(size)
print(rows)
print(cols)

(4, 2)
4
2

In [1]:
# 
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 4),['row1', 'row2', 'row3', 'row4', 'row5'], ['col1', 'col2', 'col3', 'col4'])
df

          col1      col2      col3      col4
row1 -0.257434  0.154118 -0.259858 -1.438592
row2  0.171767  0.363662 -0.855408  0.871615
row3 -0.639041  0.267109 -0.552535  1.394454
row4  1.074235 -1.059103 -0.952584 -0.886814
row5  0.582469 -1.809026 -0.579663  1.093202

In [2]:
# Selecting column
df['col1'] # df.col1

row1   -0.257434
row2    0.171767
row3   -0.639041
row4    1.074235
row5    0.582469
Name: col1, dtype: float64

In [4]:
# Selecting two columns
df[['col1', 'col2']]

          col1      col2
row1 -0.257434  0.154118
row2  0.171767  0.363662
row3 -0.639041  0.267109
row4  1.074235 -1.059103
row5  0.582469 -1.809026

In [11]:
# Generating new column
df['other'] = df['col3'] + df['col4']
df

          col1      col2      col3      col4     other
row1 -0.257434  0.154118 -0.259858 -1.438592 -1.698450
row2  0.171767  0.363662 -0.855408  0.871615  0.016207
row3 -0.639041  0.267109 -0.552535  1.394454  0.841918
row4  1.074235 -1.059103 -0.952584 -0.886814 -1.839398
row5  0.582469 -1.809026 -0.579663  1.093202  0.513539

In [12]:
# Dropping columns
# Inplace is for save data
df.drop('other', axis = 1, inplace = True)
df

          col1      col2      col3      col4
row1 -0.257434  0.154118 -0.259858 -1.438592
row2  0.171767  0.363662 -0.855408  0.871615
row3 -0.639041  0.267109 -0.552535  1.394454
row4  1.074235 -1.059103 -0.952584 -0.886814
row5  0.582469 -1.809026 -0.579663  1.093202

In [14]:
#Dropping Rows
df.drop('row1')

          col1      col2      col3      col4
row2  0.171767  0.363662 -0.855408  0.871615
row3 -0.639041  0.267109 -0.552535  1.394454
row4  1.074235 -1.059103 -0.952584 -0.886814
row5  0.582469 -1.809026 -0.579663  1.093202

In [15]:
df

          col1      col2      col3      col4
row1 -0.257434  0.154118 -0.259858 -1.438592
row2  0.171767  0.363662 -0.855408  0.871615
row3 -0.639041  0.267109 -0.552535  1.394454
row4  1.074235 -1.059103 -0.952584 -0.886814
row5  0.582469 -1.809026 -0.579663  1.093202

In [16]:
# Using loc method for named index
df.loc['row1']

col1   -0.257434
col2    0.154118
col3   -0.259858
col4   -1.438592
Name: row1, dtype: float64

In [17]:
# using iloc for numeric index
df.iloc[0]

col1   -0.257434
col2    0.154118
col3   -0.259858
col4   -1.438592
Name: row1, dtype: float64

In [19]:
# Selecting specific values
df.loc['row1', 'col2']

0.15411825476512125

In [20]:
#Selecting several values
df.loc[['row1', 'row2'],['col1', 'col3']]

          col1      col3
row1 -0.257434 -0.259858
row2  0.171767 -0.855408

In [21]:
# Conditional selecting
df[df['col1'] > 0]

          col1      col2      col3      col4
row2  0.171767  0.363662 -0.855408  0.871615
row4  1.074235 -1.059103 -0.952584 -0.886814
row5  0.582469 -1.809026 -0.579663  1.093202

In [24]:
# Selecting from conditionals
df[df['col1'] > 0][['col2', 'col4']]

          col2      col4
row2  0.363662  0.871615
row4 -1.059103 -0.886814
row5 -1.809026  1.093202

In [29]:
# Multiple conditions
# & is for "and" in columns. | is for "or"
df[(df['col1'] < 0) & (df['col3'] < 0)]

          col1      col2      col3      col4
row1 -0.257434  0.154118 -0.259858 -1.438592
row3 -0.639041  0.267109 -0.552535  1.394454

In [32]:
# Multiple levels for index
out_ = ['O1', 'O1', 'O1', 'O2', 'O2', 'O2']
in_ = [1, 2, 3, 1, 2, 3]
h_index = list(zip(out_, in_))
h_index = pd.MultiIndex.from_tuples(h_index)

In [34]:
import numpy as np
import pandas as pn

df_m = pn.DataFrame(np.random.rand(6,5), h_index, ['col1', 'col2', 'col3', 'col4', 'col5'])
df_m

          col1      col2      col3      col4      col5
O1 1  0.640848  0.624012  0.853097  0.949493  0.369429
   2  0.506629  0.733699  0.152612  0.983991  0.088470
   3  0.050893  0.750073  0.882171  0.604374  0.568416
O2 1  0.614922  0.905208  0.644890  0.050894  0.743275
   2  0.519604  0.584322  0.906203  0.966722  0.460615
   3  0.718151  0.259295  0.516030  0.565715  0.537558

In [37]:
# Adding names to indexes
df_m.index.names = ['Groups','Nums']
df_m

                 col1      col2      col3      col4      col5
Groups Nums
O1     1     0.640848  0.624012  0.853097  0.949493  0.369429
       2     0.506629  0.733699  0.152612  0.983991  0.088470
       3     0.050893  0.750073  0.882171  0.604374  0.568416
O2     1     0.614922  0.905208  0.644890  0.050894  0.743275
       2     0.519604  0.584322  0.906203  0.966722  0.460615
       3     0.718151  0.259295  0.516030  0.565715  0.537558

In [35]:
# Selecting a sub dataframe
df_m.loc['O1']

       col1      col2      col3      col4      col5
1  0.640848  0.624012  0.853097  0.949493  0.369429
2  0.506629  0.733699  0.152612  0.983991  0.088470
3  0.050893  0.750073  0.882171  0.604374  0.568416

In [39]:
# Using missing values
d = {'A':[10, np.nan], 'B':[np.nan, 50] }
df_d = pn.DataFrame(d)
df_d

      A     B
0  10.0   NaN
1   NaN  50.0

In [41]:
df_d.dropna()

Empty DataFrame
Columns: [A, B]
Index: []

In [46]:
df_d.fillna('filled')

        A       B
0      10  filled
1  filled      50